article/macOS-default-options.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-19 Sat 16:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>macOS 的一些默认选型设置</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">macOS 的一些默认选型设置</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc23ce27">1. 基本设置</a></li>
<li><a href="#org37abc62">2. 屏幕设置</a></li>
<li><a href="#org7962316">3. Finder</a></li>
<li><a href="#orge702e90">4. Software update</a></li>
<li><a href="#orgea70148">5. Dock</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgc23ce27" class="outline-2">
<h2 id="orgc23ce27"><span class="section-number-2">1</span> 基本设置</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#20445;&#25345;&#27963;&#36291;&#29366;&#24577;&#65292;&#30452;&#21040;&#23436;&#25104;</span>
<span style="color: #859900;">while </span><span style="color: #6c71c4;">true</span>; <span style="color: #859900;">do</span> sudo -n true; sleep 60; <span style="color: #6c71c4;">kill</span> -0 <span style="color: #2aa198;">"$$"</span> || <span style="color: #859900;">exit</span>; <span style="color: #859900;">done</span> 2&gt;/dev/null &amp;

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#25171;&#24320;&#20851;&#38381;&#31383;&#21475;&#26102;&#31105;&#29992;&#21160;&#30011;</span>
defaults write NSGlobalDomain NSAutomaticWindowAnimationsEnabled -bool false

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#25171;&#24320; Quick Look &#31383;&#21475;&#26102;&#31105;&#29992;&#21160;&#30011;</span>
defaults write -g QLPanelAnimationDuration -float 0
</pre>
</div>
</div>
</div>

<div id="outline-container-org37abc62" class="outline-2">
<h2 id="org37abc62"><span class="section-number-2">2</span> 屏幕设置</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#30561;&#30496;&#25110;&#23631;&#24149;&#20445;&#25252;&#31243;&#24207;&#24320;&#22987;&#21518;&#31435;&#21363;&#38656;&#35201;&#23494;&#30721;</span>
defaults write com.apple.screensaver askForPassword -int 1
defaults write com.apple.screensaver askForPasswordDelay -int 0

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#23631;&#24149;&#25130;&#23631;&#20445;&#23384;&#21040;&#26700;&#38754;</span>
defaults write com.apple.screencapture location -string <span style="color: #2aa198;">"${HOME}/Desktop"</span>

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#20445;&#23384;&#26684;&#24335;&#20026; JPG</span>
defaults write com.apple.screencapture type -string <span style="color: #2aa198;">"jpg"</span>

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#25130;&#22270;&#31105;&#29992;&#38452;&#24433;</span>
defaults write com.apple.screencapture disable-shadow -bool true

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#22312;&#38750; Apple LCD &#19978;&#21551;&#29992;&#20122;&#20687;&#32032;&#23383;&#20307;&#28210;&#26579;</span>
defaults write NSGlobalDomain AppleFontSmoothing -int 2
</pre>
</div>
</div>
</div>

<div id="outline-container-org7962316" class="outline-2">
<h2 id="org7962316"><span class="section-number-2">3</span> Finder</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#31105;&#29992;&#31383;&#21475;&#21160;&#30011;&#21644;&#33719;&#21462;&#20449;&#24687;&#21160;&#30011;</span>
defaults write com.apple.finder DisableAllAnimations -bool true

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#19981;&#26174;&#31034;&#25991;&#20214;&#30340;&#25193;&#23637;&#21517;</span>
defaults write NSGlobalDomain AppleShowAllExtensions -bool false

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#26174;&#31034;&#29366;&#24577;&#26639;</span>
defaults write com.apple.finder ShowStatusBar -bool true

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#26174;&#31034;&#36335;&#24452;&#26639;</span>
defaults write com.apple.finder ShowPathbar -bool true

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#26356;&#25913;&#25991;&#20214;&#21517;&#26102;&#19981;&#35686;&#21578;</span>
defaults write com.apple.finder FXEnableExtensionChangeWarning -bool false

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#36991;&#20813;&#22312;&#32593;&#32476;&#21367;&#19978;&#21019;&#24314;.DS_Store &#25991;&#20214;</span>
defaults write com.apple.desktopservices DSDontWriteNetworkStores -bool true

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#28165;&#31354;&#22403;&#22334;&#31665;&#21069;&#19981;&#26174;&#31034;&#35686;&#21578;</span>
defaults write com.apple.finder WarnOnEmptyTrash -bool false

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#26174;&#31034;&#38544;&#34255;&#25991;&#20214;</span>
defaults write com.apple.finder AppleShowAllFiles -bool true;
</pre>
</div>
</div>
</div>

<div id="outline-container-orge702e90" class="outline-2">
<h2 id="orge702e90"><span class="section-number-2">4</span> Software update</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#31105;&#29992;&#36719;&#20214;&#33258;&#21160;&#26356;&#26032;&#26816;&#26597;</span>
defaults write com.apple.SoftwareUpdate AutomaticCheckEnabled -bool false
</pre>
</div>
</div>
</div>

<div id="outline-container-orgea70148" class="outline-2">
<h2 id="orgea70148"><span class="section-number-2">5</span> Dock</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">Dock &#39033;&#30446;&#22270;&#26631;&#22823;&#23567;&#35774;&#32622;</span>
defaults write com.apple.dock tilesize -int 48

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#26368;&#23567;&#21270;/&#26368;&#22823;&#21270;&#31383;&#21475;&#25928;&#26524;</span>
defaults write com.apple.dock mineffect -string <span style="color: #2aa198;">"scale"</span>

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">Dock &#25171;&#24320;&#24212;&#29992;&#26102;&#31105;&#29992;&#21160;&#30011;</span>
defaults write com.apple.dock launchanim -bool false

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#19981;&#26174;&#31034;&#26368;&#36817;&#24212;&#29992;</span>
defaults write com.apple.dock show-recents -bool false

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#37325;&#26032;&#25972;&#29702; Dock</span>
dockutil --no-restart --remove all
dockutil --no-restart --add <span style="color: #2aa198;">"/Applications/WeChat.app"</span>
dockutil --no-restart --add <span style="color: #2aa198;">"/Applications/QQ.app"</span>
dockutil --no-restart --add <span style="color: #2aa198;">"/Applications/iTerm.app"</span>
dockutil --no-restart --add <span style="color: #2aa198;">"/System/Applications/System Preferences.app"</span>

killall Dock
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2020-09-19 Sat 16:57. Created by Jinghui Hu at 2020-08-23 Sun 09:21.</p>
</div>
</body>
</html>
